console.log('number' + 3 + 3) // Відповідь: number33; 
// Стрінга + цифра + цифра = конкатенація через наявність стрінги

console.log(null + 3) // Відповідь: 3; 
// null це false, false це 0, 0 + 3 = 3, або null одразу вважати 0

console.log(5 && "qwerty") // Відповідь:"qwerty; 
// 5 = тру, qwerty = тру, обидва оперетори в тру, виведе останній тру

console.log(+'40' + +'2' + "hillel") // Відповідь: 42hillel;
// +'40' і +'2' переводимо до чисел, сумуємо та + "hillel" конкатенація

console.log('10' - 5 === 6) // Відповідь: false;
// 10 - 5 = 5, 5 = 6 - false, оператор порівніння типів ===

console.log(true + false) // Відповідь: 1;
// 1 + 0 = 1

console.log('4px' - 3) // Відповідь: -1px (INCORRECT); Термінал: NaN
// переплутав з конкатенацією "+", подумав для мінусу теж буде конкат.

console.log('4' - 3) // Відповідь: NaN (INCORRECT); Термінал: 1;
// цю логіку треба ще запам'ятати =)

console.log('6' + 3 ** 0) // Відповідь: 0 (INCORRECT); Термінал: 1; 
//не знав, знайшов інформацію: Любe число в степені 0 рівно 1

console.log(12 / '6') // Відповідь: 2;
//12 / 6 = 2; арифметична операція '6' визначає як число 6

console.log('10' + (5 === 6)) // Відповідь: 10false;
//спочатку порівняли типи 5 і 6 = false, 5 менше 6, і додали 10 стрінгу конкатенацією

console.log(null == '') // Відповідь: true (INCORRECT); Термінал: false
//думав що буде "0" == '', але не відбулося приведення типів, якщо взяти +null == '', то буде true

console.log(3 ** (9 / 3)) // Відповідь: 27;
//9 / 3 = 3, 3*3*3 = 27

console.log(!!'false' == !!'true') // Відповідь: false (INCORRECT); Термінал: true
// думав переведе в булеан 0 == 1 буде false

console.log(0 || '0' && 1) // Відповідь: - (INCORRECT); Термінал: 1
// не дуже зрозумів по пріоритетам і з чого почати дивитись

console.log((+null == false) < 1) // Відповідь: true (INCORRECT); Термінал: false
// дивився як  0 < 1

console.log((+null == false) < 1) // Відповідь: true (INCORRECT); Термінал: false
// дивився як  0 < 1, не врахував порівняння

console.log(false && true || true) // Відповідь: true
// && якщо 1 фолс поверне фолс, фолс || тру = true

console.log(false && (false || true)) // Відповідь: false
// false || true = true, потім false && true = false

console.log((+null == false) < 1 ** 5) // Відповідь: false
//+null == false - Це 1, потім 1 < 1 = false


/* - Відповідей: = 20;
   - Неправильні = 8;
   з них правильних = 12;
   
   неправильні відповіді можна відслідкувати через пошук по (INCORRECT)
*/
